MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_dsogi_pll.h
/**
 *******************************************************************************
 * @file hc32_ll_dsogi_pll.h
 * @brief This file contains all the functions prototypes of the DSOGI_PLL driver
 *        library.
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_DSOGI_PLL_H__
#define __HC32_LL_DSOGI_PLL_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f5xx.h"
#include "hc32f5xx_conf.h"

    /**
     * @addtogroup LL_Driver
     * @{
     */

    /**
     * @addtogroup LL_DSOGI_PLL
     * @{
     */

#if (LL_DSOGI_PLL_ENABLE == DDL_ON)

    /*******************************************************************************
     * Global type definitions ('typedef')
     ******************************************************************************/
    /**
     * @defgroup DSOGI_PLL_Global_Types DSOGI_PLL Global Types
     * @{
     */

    /**
     * @brief Base init structure definition
     */
    typedef struct
    {
        float32_t f32Ts;       /*!< Specifies the sample time. relate of ADC sample frequency */
        float32_t f32BaseFreq; /*!< Specifies the base frequency of grid */
    } stc_base_init_t;

    /**
     * @brief Clark init structure definition
     */
    typedef struct
    {
        uint32_t u32SrcSelect;     /*!< Specifies the input source of clark.
                                             When input source is not abc, a/b/c register prohibit config.
                                             Data can only be written through a/b/c register when clark independent run.
                                             This parameter can be a value of @ref DSOGI_PLL_CLARK_INPUT_SEL */
        uint32_t u32VoltageSelect; /*!< Specifies the calculation voltage, valid only when three-phase voltage input  .
                                              This parameter can be a value of @ref DSOGI_PLL_CLARK_VOLT_SEL */
        uint32_t u32AdcGain;       /*!< Specifies the gain of adc when adc as clark input, valid only when adc as clark input.
                                             This parameter can be a value of @ref DSOGI_PLL_ADC_GAIN_SEL */
    } stc_clark_init_t;

    /**
     * @brief Sogi init structure definition
     */
    typedef struct
    {
        uint32_t u32SogiSCSelect; /*!< Specifies the calculation select of sogi or enable/disable pll sin/cos calculation.
                                             Independent mode: support 1 or 2 calculation; combo mode(use sogi): enable or disable pll sin/cos calculation
                                             This parameter can be a value of @ref DSOGI_PLL_SOGI_SC_SEL */
        uint32_t u32FLLState;     /*!< Enable or disable the frequency lock loop function of SOGI.
                                             When FLL is enable the w of sogi is updated with new value of FLL.
                                             This parameter can be a value of @ref DSOGI_PLL_FLL_SEL */
    } stc_sogi_init_t;

    /**
     * @brief Park Init structure definition
     */
    typedef struct
    {
        uint32_t u32ThetaSelect; /*!< Specifies the d/q signal of park output to pll.
                                             When the system is independent mode, it is invalid
                                             This parameter can be a value of @ref DSOGI_PLL_PARK_THETA_SEL */
    } stc_park_init_t;

    /**
     * @brief Pll Init structure definition
     */
    typedef struct
    {
        uint32_t u32PLLState;   /*!< Enable or disable hardware the phase lock loop function of PLL.
                                             When the system is comb mode and PLL is disable, w and theta be write through sogi's w register and park's theta register.
                                             It is invalid when the system is independent mode.
                                             This parameter can be a value of @ref DSOGI_PLL_PLL_SEL */
        uint32_t u32PIState;    /*!< Enable or disable PI of the phase lock loop function of PLL.
                                             When PI is disable the out frequency of pll equal the base frequency of sogi.
                                             This parameter can be a value of @ref DSOGI_PLL_PI_SEL */
        uint32_t u32JudgeState; /*!< Enable or disable the voltage-judge function to control PWM.
                                             It is invalid when the system is independent mode.
                                             This parameter details refer @ref DSOGI_PLL_JUDGE_SEL */
        uint32_t u32DelayTime;  /*!< Pll fail delaytime. less than DSOGI_PLL_DELAYTIME_MAX. actual value equal delaytime * 256 */
    } stc_pll_init_t;

    /**
     * @brief DSOGI_PLL Phase-Locked init structure definition
     */
    typedef struct
    {
        uint32_t u32Func; /*!< Specifies the function of DSOGI_PLL.
                                             This parameter can be a value of @ref DSOGI_PLL_COMB_FUNC_SEL */
        stc_clark_init_t stcClarkInit; /*!< Clark initialize structure.
                                             This parameter details refer @ref stc_clark_init_t */
        stc_sogi_init_t stcSogiInit;   /*!< Sogi initialize structure.
                                             This parameter details refer @ref stc_sogi_init_t */
        stc_park_init_t stcParkInit;   /*!< Park initialize structure.
                                             This parameter details refer @ref stc_park_init_t */
        stc_pll_init_t stcPllInit;     /*!< Pll initialize structure.
                                             This parameter details refer @ref stc_pll_init_t */
        stc_base_init_t stcBaseInit;   /*!< Base initialize structure.
                                             This parameter details refer @ref stc_base_init_t */
    } stc_sogi_pll_init_t;

    /**
     * @brief Clark configuration structure definition
     */
    typedef struct
    {
        float32_t clark_k; /*!< Specifies the coefficient of low pass filter of clark */
    } stc_clark_config_t;

    /**
     * @brief SOGI configuration structure definition
     */
    typedef struct
    {
        float32_t sogi_k; /*!< Specifies the gain coefficient of sogi */

        float32_t sogi_d_k; /*!< Specifies the coefficient of low pass filter of d axis */

        float32_t sogi_q_k; /*!< Specifies the coefficient of low pass filter of q axis */

