MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_dsogi_pll.h
        float32_t sogi_fll_k; /*!< Specifies the gain coefficient of d fll */

        float32_t sogi_max; /*!< Specifies the upper limit value of signal */

        float32_t sogi_min; /*!< Specifies the lower limit value of signal */

        float32_t sogi_w; /*!< Specifies the central angular frequency of signal
                                             When MODE is 1 and FLL_EN is 0, SOGI's w comes from the PLL's w register; when MODE is 1 and FLL_EN is 1, or when MODE is 0, SOGI's w comes from SOGI's own w register
                                             When FLL is 1, if iterative operation must configure w on the first Calculation then prohibit configure again until reset sogi. the w of sogi is updated with new value of FLL */
    } stc_sogi_config_t;

    /**
     * @brief Park configuration structure definition
     */
    typedef struct
    {
        float32_t park_theta; /*!< Specifies the phase for park Calculation, range -pi ~ pi
                                             When MODE is 1 and PLL_EN is 1, theta come from PLL theta register. when MODE is 1 and PLL_EN is 0, or when MODE is 0 theta is sourced from own register */
    } stc_park_config_t;

    /**
     * @brief Pll configuration structure definition
     */
    typedef struct
    {
        float32_t pll_k; /*!< Specifies coefficient of low pass filter of pll */

        float32_t pll_kp; /*!< Specifies the gain coefficient of pll */

        float32_t pll_ki_ts; /*!< Specifies the Integral coefficient of pll */

        float32_t pll_max; /*!< Specifies the upper limit value of pi */

        float32_t pll_min; /*!< Specifies the lower limit value of pi */

        float32_t pll_err; /*!< Specifies the threshold of err value for pll lock phase */

        float32_t pll_theta_cmp1; /*!< Specifies the lower limit phase for pwm1 event judge */

        float32_t pll_theta_cmp2; /*!< Specifies the upper limit phase for pwm1 event judge */

        float32_t pll_theta_cmp3; /*!< Specifies the lower limit phase for pwm2 event judge */

        float32_t pll_theta_cmp4; /*!< Specifies the upper limit phase for pwm2 event judge */

        float32_t pll_v_cmp; /*!< Specifies the threshold voltage for pwm event judge if the JUDGE_EN bit in CR is enable */

        float32_t pll_theta_step; /*!< Specifies the phase step for period trigger interrupt */

        float32_t pll_w; /*!< angular frequency of pll.
                                             When MODE is 1 and PLL_EN is 1, or when MODE is 0 FUNC is 3, the w of PLL is updated with new value of Calculation result
                                             Must configure w on the first Calculation then prohibit configure again until reset PLL. */
    } stc_pll_config_t;

    /**
     * @brief Clark input structure definition
     */
    typedef struct
    {
        float32_t a; /*!< Specifies input value of a phase */
        float32_t b; /*!< Specifies input value of b phase */
        float32_t c; /*!< Specifies input value of c phase */
    } stc_clark_input_t;

    /**
     * @brief Clark output structure definition
     */
    typedef struct
    {
        float32_t alpha;    /*!< Specifies output value of alpha axis */
        float32_t beta;     /*!< Specifies output value of beta axis */
        float32_t a_filter; /*!< Specifies output value of a phase filter */
        float32_t b_filter; /*!< Specifies output value of b phase filter */
        float32_t c_filter; /*!< Specifies output value of c phase filter */
    } stc_clark_output_t;

    /**
     * @brief Sogi input structure definition
     */
    typedef struct
    {
        float32_t alpha; /*!< Specifies input signal of alpha axis */
        float32_t beta;  /*!< Specifies input signal of beta axis */
    } stc_sogi_input_t;

    /**
     * @brief Sogi output structure definition
     */
    typedef struct
    {
        float32_t alpha_dv; /*!< output signal of alpha axis follow input */
        float32_t alpha_qv; /*!< output Quadrature signal of alpha axis follow input */
        float32_t beta_dv;  /*!< output signal of beta axis follow input */
        float32_t beta_qv;  /*!< output Quadrature signal of beta axis follow input */
        float32_t alpha_p;  /*!< output positive signal of alpha axis follow input */
        float32_t beta_p;   /*!< output positive signal of beta axis follow input */
        float32_t alpha_n;  /*!< output negative signal of alpha axis follow input */
        float32_t beta_n;   /*!< output negative signal of beta axis follow input */
    } stc_sogi_output_t;

    /**
     * @brief Park input structure definition
     */
    typedef struct
    {
        float32_t alpha; /*!< Specifies input signal of alpha axis */
        float32_t beta;  /*!< Specifies input signal of beta axis */
        float32_t theta; /*!< Specifies the phase for park Calculation, range -pi ~ pi */
    } stc_park_input_t;

    /**
     * @brief Park output structure definition
     */
    typedef struct
    {
        float32_t d;         /*!< Park transform output signal of d axis */
        float32_t q;         /*!< Park transform output signal of q axis */
        float32_t sin_theta; /*!< Sin value of output theta */
        float32_t cos_theta; /*!< Cos value of output theta */
    } stc_park_output_t;

    /**
     * @brief Pll input structure definition
     */
    typedef struct
    {
        float32_t din; /*!< Pll input signal */
    } stc_pll_input_t;

    /**
     * @brief Pll output structure definition
     */
    typedef struct
    {
        float32_t w;          /*!< angle frequency output of pll */
        float32_t theta;      /*!< Phase output of pll */
        float32_t p;          /*!< P value of pll pi */
        float32_t i;          /*!< I value of pll pi */
        float32_t pi;         /*!< Output of pll pi */
        float32_t theta_pi;   /*!< Output theta to park module */
        float32_t freq;       /*!< Frequency output of pll */
        float32_t din_filter; /*!< Filtered input signal of pll */
        float32_t sin_theta;  /*!< Sin value of output theta */
        float32_t cos_theta;  /*!< Cos value of output theta */
    } stc_pll_output_t;

/**
 * @}
 */

