MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_dsogi_pll.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup DSOGI_PLL_Global_Macros DSOGI_PLL Global Macros
 * @{
 */

/**
 * @defgroup DSOGI_PLL_COMB_FUNC_SEL DSOGI_PLL Comb Function Select
 * @{
 */
#define DSOGI_PLL_COMB_THREE_PHASE_DSOGI (DSOGI_PLL_CR_MODE)
#define DSOGI_PLL_COMB_THREE_PHASE_SYNC  (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC_0)
#define DSOGI_PLL_COMB_SINGLE_PHASE      (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC_1)
#define DSOGI_PLL_COMB_FUN_MASK          (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_FUNC_SEL DSOGI_PLL Function Select
 * @{
 */
#define DSOGI_PLL_THREE_PHASE_DSOGI (DSOGI_PLL_CR_MODE)
#define DSOGI_PLL_THREE_PHASE_SYNC  (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC_0)
#define DSOGI_PLL_SINGLE_PHASE      (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC_1)
#define DSOGI_PLL_CLARK             (0UL)
#define DSOGI_PLL_SOGI              (DSOGI_PLL_CR_FUNC_0)
#define DSOGI_PLL_PARK              (DSOGI_PLL_CR_FUNC_1)
#define DSOGI_PLL_PLL               (DSOGI_PLL_CR_FUNC)
#define DSOGI_PLL_FUN_MASK          (DSOGI_PLL_CR_MODE | DSOGI_PLL_CR_FUNC)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_CLARK_INPUT_SEL DSOGI_PLL Clark Input Select
 * @{
 */
#define DSOGI_PLL_CLARK_ABC      (0UL)
#define DSOGI_PLL_CLARK_ADC1_234 (DSOGI_PLL_CR_DIN_SEL)
#define DSOGI_PLL_CLARK_ADC123_2 (DSOGI_PLL_CR_DIN_SEL | DSOGI_PLL_CR_ADC_SEL)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_CLARK_VOLT_SEL DSOGI_PLL Clark Voltage Select
 * @{
 */
#define DSOGI_PLL_CLARK_PHASE_VOLT_AB   (0UL)
#define DSOGI_PLL_CLARK_PHASE_VOLT_BC   (DSOGI_PLL_CR_VOL_SEL_0)
#define DSOGI_PLL_CLARK_PHASE_VOLT_AC   (DSOGI_PLL_CR_VOL_SEL_1)
#define DSOGI_PLL_CLARK_PHASE_VOLT_ABC  (DSOGI_PLL_CR_VOL_SEL)
#define DSOGI_PLL_CLARK_LINE_VOLT_AC_BC (DSOGI_PLL_CR_LVOL_EN)
#define DSOGI_PLL_CLARK_LINE_VOLT_AB_AC (DSOGI_PLL_CR_LVOL_EN | DSOGI_PLL_CR_VOL_SEL_0)
#define DSOGI_PLL_CLARK_LINE_VOLT_AB_BC (DSOGI_PLL_CR_LVOL_EN | DSOGI_PLL_CR_VOL_SEL_1)
#define DSOGI_PLL_CLARK_VOLT_MASK       (DSOGI_PLL_CR_LVOL_EN | DSOGI_PLL_CR_VOL_SEL)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_ADC_GAIN_SEL DSOGI_PLL ADC Gain Select
 * @{
 */
#define DSOGI_PLL_ADC_DIV1    (0UL)
#define DSOGI_PLL_ADC_DIV256  (DSOGI_PLL_CR_ADC_GN_0)
#define DSOGI_PLL_ADC_DIV1024 (DSOGI_PLL_CR_ADC_GN_1)
#define DSOGI_PLL_ADC_DIV2048 (DSOGI_PLL_CR_ADC_GN)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_SOGI_SC_SEL DSOGI_PLL SOGI Calculation Select or Sin/Cos Calculation Enable/Disable
 * @{
 */
#define DSOGI_PLL_SOGI_CAUL_1          (0UL)
#define DSOGI_PLL_SOGI_CAUL_2          (DSOGI_PLL_CR_SOGI_SC)
#define DSOGI_PLL_SOGI_SIN_COS_DISABLE (0UL)
#define DSOGI_PLL_SOGI_SIN_COS_ENABLE  (DSOGI_PLL_CR_SOGI_SC)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_FLL_SEL DSOGI_PLL Frequency-Lock Select
 * @{
 */
#define DSOGI_PLL_FLL_DISABLE (0UL)
#define DSOGI_PLL_FLL_ENABLE  (DSOGI_PLL_CR_FLL_EN)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_PARK_THETA_SEL DSOGI_PLL PARK Theta Select
 * @{
 */
#define DSOGI_PLL_PARK_THETA_Q (0UL)
#define DSOGI_PLL_PARK_THETA_D (DSOGI_PLL_CR_THETA_SEL)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_PI_SEL DSOGI_PLL PI Select
 * @{
 */
#define DSOGI_PLL_PI_DISABLE (0UL)
#define DSOGI_PLL_PI_ENABLE  (DSOGI_PLL_CR_PI_EN)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_PLL_SEL DSOGI_PLL PLL Select
 * @{
 */
#define DSOGI_PLL_PLL_DISABLE (0UL)
#define DSOGI_PLL_PLL_ENABLE  (DSOGI_PLL_CR_PLL_EN)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_JUDGE_SEL DSOGI_PLL Judge Select
 * @{
 */
#define DSOGI_PLL_JUDGE_DISABLE (0UL)
#define DSOGI_PLL_JUDGE_ENABLE  (DSOGI_PLL_CR_JUDGE_EN)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_DELAYTIME DSOGI_PLL DelayTime
 * @{
 */
#define DSOGI_PLL_DELAYTIME_MAX (0x1FUL)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_INT DSOGI_PLL INT
 * @{
 */
#define DSOGI_PLL_INT_CALC_CPLT   (DSOGI_PLL_CR_INTC1_EN)
#define DSOGI_PLL_INT_PERIOD_CPLT (DSOGI_PLL_CR_INTC2_EN)
#define DSOGI_PLL_INT_MASK        (DSOGI_PLL_INT_CALC_CPLT | DSOGI_PLL_INT_PERIOD_CPLT)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_FLAG DSOGI_PLL Flag
 * @{
 */
#define DSOGI_PLL_FLAG_PLL_SC       (DSOGI_PLL_ST_SC_FLAG)
#define DSOGI_PLL_FLAG_HRPWM2       (DSOGI_PLL_ST_HRPWM_ENTB)
#define DSOGI_PLL_FLAG_HRPWM1       (DSOGI_PLL_ST_HRPWM_ENTA)
#define DSOGI_PLL_FLAG_FP           (DSOGI_PLL_ST_FP_FLAG)
#define DSOGI_PLL_FLAG_PERIOD       (DSOGI_PLL_ST_INTC2_FLAG)
#define DSOGI_PLL_FLAG_CALC         (DSOGI_PLL_ST_INTC1_FLAG)
#define DSOGI_PLL_FLAG_PHASE_FAIL   (DSOGI_PLL_ST_PLL_FAIL)
#define DSOGI_PLL_FLAG_PHASE_RESULT (DSOGI_PLL_ST_RES)
#define DSOGI_PLL_FLAG_MASK                                                                                            \
    (DSOGI_PLL_FLAG_PLL_SC | DSOGI_PLL_FLAG_HRPWM2 | DSOGI_PLL_FLAG_HRPWM1 | DSOGI_PLL_FLAG_FP | DSOGI_PLL_FLAG_PERIOD \
     | DSOGI_PLL_FLAG_CALC | DSOGI_PLL_FLAG_PHASE_FAIL | DSOGI_PLL_FLAG_PHASE_RESULT)
/**
 * @}
 */

/**
 * @defgroup DSOGI_PLL_CLR_FLAG DSOGI_PLL Clear Flag
 * @{
 */
#define DSOGI_PLL_CLR_FLAG_PLL_SC     (DSOGI_PLL_ST_SC_FLAG)
#define DSOGI_PLL_CLR_FLAG_FP         (DSOGI_PLL_ST_FP_FLAG)
#define DSOGI_PLL_CLR_FLAG_PERIOD     (DSOGI_PLL_ST_INTC2_FLAG)
#define DSOGI_PLL_CLR_FLAG_CALC       (DSOGI_PLL_ST_INTC1_FLAG)
#define DSOGI_PLL_CLR_FLAG_PHASE_FAIL (DSOGI_PLL_ST_PLL_FAIL)
#define DSOGI_PLL_CLR_FLAG_MASK                                                                              \
    (DSOGI_PLL_CLR_FLAG_PLL_SC | DSOGI_PLL_CLR_FLAG_FP | DSOGI_PLL_CLR_FLAG_PERIOD | DSOGI_PLL_CLR_FLAG_CALC \
     | DSOGI_PLL_CLR_FLAG_PHASE_FAIL)
    /**
     * @}
     */

    /**
     * @}
     */

    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
  Global function prototypes (definition in C source)
     ******************************************************************************/
    /**
     * @addtogroup DSOGI_PLL_Global_Functions
     * @{
     */

    /* Initialization and configuration functions */
    int32_t DSOGI_PLL_DeInit(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx);

    int32_t DSOGI_PLL_StructInit(stc_sogi_pll_init_t *pstcSogiPllInit);
    int32_t DSOGI_PLL_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_pll_init_t *pstcSogiPllInit);

    int32_t DSOGI_PLL_Base_StructInit(stc_base_init_t *pstcBaseInit);
    int32_t DSOGI_PLL_Base_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_base_init_t *pstcBaseInit);
    int32_t DSOGI_PLL_Clark_StructInit(stc_clark_init_t *pstcClarkInit);
    int32_t DSOGI_PLL_Clark_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_clark_init_t *pstcClarkInit);
    int32_t DSOGI_PLL_Clark_ConfigInit(stc_clark_config_t *pstcClarkConfig);
    int32_t DSOGI_PLL_Clark_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_clark_config_t *pstcClarkConfig);
    int32_t DSOGI_PLL_Sogi_StructInit(stc_sogi_init_t *pstcSogiInit);
    int32_t DSOGI_PLL_Sogi_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_init_t *pstcSogiInit);
    int32_t DSOGI_PLL_Sogi_ConfigInit(stc_sogi_config_t *pstcSogiConfig);
    int32_t DSOGI_PLL_Sogi_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_sogi_config_t *pstcSogiConfig);
    int32_t DSOGI_PLL_Park_StructInit(stc_park_init_t *pstcParkInit);
    int32_t DSOGI_PLL_Park_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_park_init_t *pstcParkInit);
    int32_t DSOGI_PLL_Park_ConfigInit(stc_park_config_t *pstcParkConfig);
    int32_t DSOGI_PLL_Park_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_park_config_t *pstcParkConfig);
    int32_t DSOGI_PLL_Pll_StructInit(stc_pll_init_t *pstcPllInit);
    int32_t DSOGI_PLL_Pll_Init(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_pll_init_t *pstcPllInit);
    int32_t DSOGI_PLL_Pll_ConfigInit(stc_pll_config_t *pstcPllConfig);
    int32_t DSOGI_PLL_Pll_Config(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, const stc_pll_config_t *pstcPllConfig);

