MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_dsogi_pll.h
    void DSOGI_PLL_Set_Func(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Func);
    void DSOGI_PLL_PLL_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_PI_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_FLL_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_Judge_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_SWReset(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_Start_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);
    void DSOGI_PLL_PLL_SC_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, en_functional_state_t enNewState);

    void DSOGI_PLL_Sogi_Calc_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32SogiSelect);
    void DSOGI_PLL_Park_Theta_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32ThetaSelect);
    void DSOGI_PLL_Clark_Input_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32InputSelect);
    void DSOGI_PLL_Clark_Voltage_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32VoltageSelect);
    void DSOGI_PLL_Clark_Adc_Gain_Select(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32AdcGainSelect);

    void DSOGI_PLL_Set_Delaytime(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32DelayTime);

    void DSOGI_PLL_Int_Cmd(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32IntType, en_functional_state_t enNewState);

    en_flag_status_t DSOGI_PLL_GetStatus(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Flag);
    void DSOGI_PLL_ClearStatus(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, uint32_t u32Flag);

    int32_t DSOGI_PLL_Clark_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_clark_input_t *pstcClarkInput);
    int32_t DSOGI_PLL_Clark_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_clark_output_t *pstcClarkOutput);
    int32_t DSOGI_PLL_Sogi_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_sogi_input_t *pstcSogiInput);
    int32_t DSOGI_PLL_Sogi_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_sogi_output_t *pstcSogiOutput);
    int32_t DSOGI_PLL_Park_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_park_input_t *pstcParkInput);
    int32_t DSOGI_PLL_Park_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_park_output_t *pstcParkOutput);
    int32_t DSOGI_PLL_Pll_Input(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_pll_input_t *pstcPllInput);
    int32_t DSOGI_PLL_Pll_Output(CM_DSOGI_PLL_TypeDef *DSOGI_PLLx, stc_pll_output_t *pstcPllOutput);
/**
 * @}
 */
#endif /* LL_DSOGI_PLL_ENABLE */

    /**
     * @}
     */

    /**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_LL_DSOGI_PLL_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
